In [ ]:
'''
Joining Data
    - read 'u.item' into 'movies'
    - merge 'movies' and 'ratings' (inner join on 'movie_id')

'''

In [4]:
import pandas as pd
import numpy as np

In [6]:
# read 'u.item' into 'movies'
m_cols = ['movie_id', 'title']
movies = pd.read_table('./data/u.item', header=None, names=m_cols, sep='|', usecols=[0, 1], encoding='latin-1')
movies.head()
movies.shape

(1682, 2)

In [7]:
movies.head(2)

   movie_id             title
0         1  Toy Story (1995)
1         2  GoldenEye (1995)

In [8]:
# read 'u.data' into 'ratings'
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_table('./data/u.data', header=None, names=r_cols, sep='\t')
ratings.head()
ratings.shape

(100000, 4)

In [9]:
ratings.head(2)

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742

In [10]:
# merge 'movies' and 'ratings' (inner join on 'movie_id')
movie_ratings = pd.merge(movies, ratings)
movie_ratings.head()

   movie_id             title  user_id  rating  unix_timestamp
0         1  Toy Story (1995)      308       4       887736532
1         1  Toy Story (1995)      287       5       875334088
2         1  Toy Story (1995)      148       4       877019411
3         1  Toy Story (1995)      280       4       891700426
4         1  Toy Story (1995)       66       3       883601324

In [11]:
movie_ratings.shape

(100000, 5)